[
    {
        "name": "Roast Chicken",
        "category": "Main Course",
        "meat": "Poultry",
        "cookTime": "90 minutes",
        "id": 1001,
        "isFeatured": true,
        "isFavorite": true,
        "country": "France",
        "ingredients": "4 pound whole chicken\n\n1/4 cup unsalted butter, melted\n\n4 tablespoons olive oil\n\n1/4 cup white wine, optional Sauvignon or Chardonnay\n\n1 lemon, halved\n\nSalt and pepper\n\n2 tablespoons chopped parsley\n\n4 garlic cloves, minced\n\n1 head of garlic roughly peeled\n\n3 fresh whole rosemary sprigs\n\n1 Roasting pan",
        "description": "Take chicken out of fridge one to two hours before starting your roast. Don’t forget to remove giblets and neck from cavity.\n\nPreheat oven at 430°F.\n\nRinse and pat dry the chicken with paper towel.\n\nSeason the chicken generously, outside and inside with salt, pepper and parsley. \n\nCombine olive oil, melted butter, wine and lemon juice.\n\nRub the above mixture all over the chicken, under the skin and inside the cavity.\n\nStuff the garlic head into the chicken cavity along with the thyme, the rosemary sprigs and the squeezed lemon halve.\n\n Set the chicken breast-side up in a roasting pan, and place in the oven.\n\nAfter one hour, lower the temperature to 325°F for another 20 to 30 minutes.\n\nIf the skin looks burnt, lay an aluminum foil on top of the chicken and continue cooking.\n\nBaste the chicken every 30 minutes.\n\nWhen the Chicken is cooked, remove it from the oven, cover with foil and allow to stand for 10 minutes before carving.\n\nDrizzle with juices from pan and lemon juice, then serve.\n\n",
        "imageName": "roastchickenfull"
    },
    {
        "name": "Meatballs",
        "category": "Main Course",
        "meat": "Beef, Lamb",
        "cookTime": "2 hours",
        "id": 1002,
        "isFeatured": false,
        "isFavorite": true,
        "country": "France",
        "ingredients": "1/2 pound ground beef\n\n1/2 pound ground lamb\n\n1/3 cup bread crumbs\n\n1/3 cup milk\n\n1 egg yolk\n\n1 tbsp tomato paste\n\n1/3 cup of grated Parmesan\n\n1/3 cup flour (for the very end)\n\n1 onion \n\n2 garlic cloves\n\n1/3 bunch of cilantro (optional)\n\n1/2 tsp Salt, pepper, cayenne\n\n2 cups of tomato sauce\n\n1 cup of vegetable oil \n\n1 mixing bowl",
        "description": "If using breadcrumbs, disregard this first step. Put the bread to soak in the milk during 5 minutes then press it between your fingers. You can discard the rest of the milk.\n\nIn your mixing bowl, place all the ingredients except the flour.\n\nMix everything carefully, using your hands if possible.\n\nRoll the meatballs between your two hands, then roll each meat ball in the flour and set the floured meat balls on a plate.\n\nPut the plate with the meat balls in the fridge for about one hour (very important step).\n\nWarm the oil at 350°F in a frying pan and cook the meat balls in small batches so the oil’s temperature stays the same throughout. You want the meatballs to get golden brown but not fully cooked.\n\nTake out them once golden brown, set them aside and discard the oil (but do not wash the pan).\n\nAdd the tomato sauce in the pan, warm at 300°F approximately. When the sauce is warm, add the meatballs cover the pan with a lid and let cook for another 15 to 20 minutes.\n\nServe your meatballs on rice, spaghetti, or mashed potatoes, with a side of green lettuce.",
        "imageName": "meatballsfull"
    },
    {
        "name": "Chickpea Salad",
        "category": "Appetizers",
        "meat": "Vegetarian",
        "cookTime": "20 minutes",
        "id": 1003,
        "isFeatured": false,
        "isFavorite": true,
        "country": "America",
        "ingredients": "Chickpeas\n\n400g / 14 oz can chickpeas, drained\n\n2 tbsp olive oil\n\nChickpeas spices\n\n1 tsp ground cumin\n\n1 1/2 tsp All Spice\n\n1 tsp ground cardamon\n\n1/4 tsp salt\n\nSalad\n\n2 cucumbers , diced\n\n2 tomatoes, diced\n\n1 red onion (small) , diced\n\n1/4 cup coriander leaves (cilantro), roughly chopped\n\n1/4 cup Italian parsley, roughly chopped\n\nDressing \n\n1 1/2 tbsp sherry or balsamic vinegar\n\nZest of half a lemon\n\n2 tbsp lemon juice\n\n1/4 cup extra virgin olive oil\n\n1 tsp caster sugar\n\n1 or 2 garlic clove, smashed\n\nSalt and pepper",
        "description": "Combine the Dressing ingredients in a jar and shake. Set aside for 20 minutes to allow the flavors to develop.\n\nPlace chickpeas in a large bowl. Scatter over Spices, toss to coat. The wetness of the chickpeas will make the spices stick.\n\nHeat 2 tbsp olive oil in a large pan over high heat and fry the chickpeas for a couple of minutes. Shake the pan so the chickpeas roll, or stir gently (so the spice coating doesn't come off). Transfer into bowl and cool slightly.\n\nCombine the Salad Ingredients in a bowl. Drizzle with a bit of Dressing and toss. Transfer to serving bowl.\n\nTop salad with chickpeas (warm or at room temperature). Drizzle with more Dressing. Toss very gently, if desired (don't toss too much or spices may shake off of the chickpeas). Serve immediately.\n\nGreat served with Greek yogurt and pita bread to stuff the salad into.",
        "imageName": "croutonsaladfull"
    },
    {
        "name": "Sauteed Shrimp",
        "category": "Main Course",
        "meat": "Shellfish",
        "cookTime": "5 minutes",
        "id": 1004,
        "isFeatured": false,
        "isFavorite": true,
        "country": "Italy",
        "ingredients": "1 serving: 5 to 8 medium sized shrimps\n\n1 tablespoon salted butter\n\n1 teaspoon vegetable oil\n\n2 tablespoons of flour\n\nsalt & pepper",
        "description": "This can be made with fresh shrimp or frozen. Eitherway, make sure to lose the shells and devain the shrimps (unless you love them).\n\nRinse and pat dry, then place on a flat surface or plate. Sift flour onto shrimp, evenly distributing flour all around.\n\nHeat up a non-stick or cast iron to a medium to high heat, and drop in your butter with oil. Once the butter is frothing, gently drop in your shrimps.\n\nAfter 15 to 30 seconds, flip the shrimps and you should see pink already coming through. Once the flesh of the shrimp is less oqaque, turn off the heat and transfer shrimp to dish. The residual heat will keep cooking them, so don't wait until they are fully white, or you'll be eating rubber. On that note, bon appetit!",
        "imageName": "buttershrimpfull"
    },
    {
        "name": "Oeufs Mimosa",
        "category": "Appetizers",
        "meat": "Vegetarian",
        "cookTime": "5 minutes",
        "id": 1005,
        "isFeatured": true,
        "isFavorite": false,
        "country": "Global",
        "ingredients": "12 Eggs\n\n1/2 cup Mayonnaise\n\n1/2 cup Fresh Parsley chopped fine\n\n1/2 cup of black pitted Mediterranean olives\n\n6 anchovies (optional)\n\nHerbed salt",
        "description": "This may also be known as deviled eggs. Prep 6 cups of water to boil in a large pot.\n\nWhen the water reaches a rolling boil, drop in the eggs delicately.\n\nAfter 10 minutes, strain the water from the pan and run cold water over the eggs to cool them quickly.\n\nPeel them: it is easier to peel the eggs under running water.\n\nCut the hard boiled eggs in half lengthwise. Carefully remove the yolks with a spoon and divide the yolks into two batches in separate bowls.\n\nBatch 1: Mash the egg yolks, add some herbed salt, then add just enough mayonnaise to make a smooth spread  and fill the egg whites with this spread.\n\nBatch 2: Using a Rotary Cheese Grater or a grater with small holes, grate the yolks in a bowl.\n\nAdd parsley and sea salt to that batch and mix delicately with a fork.\n\nSprinkle the fluffy egg yolk generously over the filled eggs.\n\nDecorate with half pitted olive and half anchovy.",
        "imageName": "eggmimosafull"
    },
    {
        "name": "Apple Compote",
        "category": "Sweets & Desserts",
        "meat": "Vegetarian",
        "cookTime": "1 hour",
        "id": 1006,
        "isFeatured": false,
        "isFavorite": false,
        "country": "France",
        "ingredients": "3 peeled apples\n\n1/4 cup brown sugar\n\n2 sticks of cinnamon\n\n1/2 cup of water\n\n1 sauce pot\n\n1 matching lid",
        "description": "Peel and cut the apples in quarters\n\nPlace the apples in a medium sized sauce pot with water and sprinkle with brown sugar. Place the cinnamon sticks in pot with apples\n\nAfter 10 minutes, lower the heat to a low heat or fire to simmer for an hour.\n\nWhen the apples are soft to the touch, they are ready. Take them off the heat and let them rest. Serve hot or cold.\n\nEnjoy!",
        "imageName": "applesaucefull"
    },
    {
        "name": "Caramel Flan",
        "category": "Sweets & Desserts",
        "meat": "Vegetarian",
        "cookTime": "1 hour",
        "id": 1007,
        "isFeatured": true,
        "isFavorite": false,
        "country": "France",
        "ingredients": "1 liter milk\n\n6 whole eggs\n\n250g sugar \n\n1 vanilla pod\n\n200g sugar\n\n5cl water\n\n4 large ramequins\n\nDeep dish for bain-marie (water bath)",
        "description": "Flan in French: Crème caramel renversée\n\n Preheat oven to 320 F\n\nCaramel : set sugar and water in a saucepan and let come to a little boil. Watch closely. When the sugar starts turning a honey color, turn off the heat.\n\n Slowly pour caramel evenly throughout ramequins and let cool to harden.\n\nIn a separate pot, bring the milk and vanilla to a near-boil, then turn off the heat. In a large mixing bowl, whisk the eggs, then add sugar to the mix, whisking consistently.\n\nStraining through a small chinois or colander, slowly pour the warm milk into the egg mixture, whisking quickly for about 2 minutes.\n\nPour the mix into the ramequins with hardened caramel.\n\nPlace the ramequins in a bain-marie in a deep tray or dish(‘bain-marie’ is a very warm bath of water). Place the tray in the 320F oven on a center or lower rack.\n\nThe water should never reach the point of boiling while in the oven.\n\nCook for about 45 min and test with a knife to see if cook is done. If and when the knife comes out clean, take the tray out of the oven.\n\nLet the flans cool down for 15 to 20 minutes, then store in the refrigerator for least 4 hours.\n\nBefore serving, place the ramequins in a dish with very warm water, let them sit for 5 minutes and turn them over, one by one, onto a shallow plate/dish with a swift and firm movement. The flipped flan should easily slip out of the ramequin onto the dish, with any melted caramel.",
        "imageName": "flanfull"
    },
    {
        "name": "Fraises au vin rouge",
        "category": "Sweets & Desserts",
        "meat": "Vegetarian",
        "cookTime": "10 minutes",
        "id": 1008,
        "isFeatured": false,
        "isFavorite": false,
        "country": "France",
        "ingredients": "1 lb strawberries\n\n14 oz of red wine (Bordeaux or Cabernet)\n\n80g of brown sugar\n\n1 cinnamon stick\n\n1 star anise\n\n2 drops of vanilla extract\n\n1 clove\n\n1 cardamome pod",
        "description": "In a sauce pan, bring to a boil the wine, the cinnamon stick and the sugar and lower the flame to simmer nicely 15 or 20 minutes, turn off the flame and let cool down.\n\nWash the strawberries and pat them dry delicately.\n\nCut the strawberries in two or three lengthwise, according to their size.\n\nPut the strawberries in a bowl. Filter the wine mixture and pour it over the strawberries.\n\nStore in the fridge for at least six hours prior to before serving.",
        "imageName": "strawberriesfull"
    },
    {
        "name": "Roasted Bell Peppers",
        "category": "Appetizers",
        "meat": "Vegetarian",
        "cookTime": "1 hour",
        "id": 1009,
        "isFeatured": true,
        "isFavorite": false,
        "country": "France",
        "ingredients": "4 red bell peppers\n\n2  oz tomato paste (approximately 1/3 of a small can)\n\n4 garlic cloves crushed\n\n5 tablespoons olive oil\n\n20 black Moroccan Oil Cured Olives pitted\n\nSalt, Cayenne pepper to taste\n\n1 tablespoon of honey",
        "description": "Preheat oven at 425°F\n\nPlace the Red Bell peppers on a tin foil in a plate in the oven\n\nLet roast for 20 minutes.\n\nTurn the peppers and put back in the oven for another 20 minutes until their skin burns a little.\n\nTake the peppers out of the oven and let them cool down.\n\nWhen cool to the touch, peel them delicately, rinse off any seeds.\n\nCut them into 1 to 1-1/2 inch strips and set in a colander during at least one hour. Discard juices that strain out.\n\n In a separate bowl, mix the tomato paste with the crushed garlic, 2 tablespoons of water and half of the olive oil.\n\nWhen the peppers are drained, put the tomato mix in a hot pan and cook briefly until the garlic is fragrant (5 minutes)\n\nAdd the peppers, the olives and the rest of the olive oil, bring to a very brief boil.\n\nLower the flame and let simmer 20 to 25 minutes.\n\nAdd salt, Cayenne pepper and honey.\n\nLet cool down and serve cold or room temp. Great as a side dish too!",
        "imageName": "redpeppersfull"
    }
    
]
