[
    {
        "name": "Roast Chicken",
        "category": "Main Course",
        "meat": "Poultry",
        "cookTime": "90 minutes at 400°F",
        "id": 1001,
        "isFeatured": false,
        "isFavorite": true,
        "country": "France",
        "ingredients": "4 pound whole chicken\n\n1/4 cup unsalted butter, melted\n\n4 tablespoons olive oil\n\n1/4 cup white wine, optional Sauvignon or Chardonnay\n\n1 lemon, halved\n\nSalt and pepper\n\n2 tablespoons chopped parsley\n\n4 garlic cloves, minced\n\n1 head of garlic roughly peeled\n\n3 fresh whole rosemary sprigs\n\n1 Roasting pan",
        "description": "Take chicken out of fridge one to two hours before starting your roast. Don’t forget to remove giblets and neck from cavity.\n\nPreheat oven at 430°F.\n\nRinse and pat dry the chicken with paper towel.\n\nSeason the chicken generously, outside and inside with salt, pepper and parsley. \n\nCombine olive oil, melted butter, wine and lemon juice.\n\nRub the above mixture all over the chicken, under the skin and inside the cavity.\n\nStuff the garlic head into the chicken cavity along with the thyme, the rosemary sprigs and the squeezed lemon halve.\n\n Set the chicken breast-side up in a roasting pan, and place in the oven.\n\nAfter one hour, lower the temperature to 325°F for another 20 to 30 minutes.\n\nIf the skin looks burnt, lay an aluminum foil on top of the chicken and continue cooking.\n\nBaste the chicken every 30 minutes.\n\nWhen the Chicken is cooked, remove it from the oven, cover with foil and allow to stand for 10 minutes before carving.\n\nDrizzle with juices from pan and lemon juice, then serve.\n\n",
        "imageName": "roastchickenfull"
    },
    {
        "name": "Meatballs",
        "category": "Main Course",
        "meat": "Beef, Lamb",
        "cookTime": "2 hours",
        "id": 1002,
        "isFeatured": true,
        "isFavorite": true,
        "country": "France",
        "ingredients": "1/2 pound ground beef\n\n1/2 pound ground lamb\n\n1/3 cup bread crumbs\n\n1/3 cup milk\n\n1 egg yolk\n\n1 tbsp tomato paste\n\n1/3 cup of grated Parmesan\n\n1/3 cup flour (for the very end)\n\n1 onion \n\n2 garlic cloves\n\n1/3 bunch of cilantro (optional)\n\n1/2 tsp Salt, pepper, cayenne\n\n2 cups of tomato sauce\n\n1 cup of vegetable oil \n\n1 mixing bowl",
        "description": "If using breadcrumbs, disregard this first step. Put the bread to soak in the milk during 5 minutes then press it between your fingers. You can discard the rest of the milk.\n\nIn your mixing bowl, place all the ingredients except the flour.\n\nMix everything carefully, using your hands if possible.\n\nRoll the meatballs between your two hands, then roll each meat ball in the flour and set the floured meat balls on a plate.\n\nPut the plate with the meat balls in the fridge for about one hour (very important step).\n\nWarm the oil at 350°F in a frying pan and cook the meat balls in small batches so the oil’s temperature stays the same throughout. You want the meatballs to get golden brown but not fully cooked.\n\nTake out them once golden brown, set them aside and discard the oil (but do not wash the pan).\n\nAdd the tomato sauce in the pan, warm at 300°F approximately. When the sauce is warm, add the meatballs cover the pan with a lid and let cook for another 15 to 20 minutes.\n\nServe your meatballs on rice, spaghetti, or mashed potatoes, with a side of green lettuce.",
        "imageName": "meatballsfull"
    },
    {
        "name": "Spiced Chickpea Salad",
        "category": "Appetizer",
        "meat": "Vegetarian",
        "cookTime": "20 minutes",
        "id": 1003,
        "isFeatured": true,
        "isFavorite": true,
        "country": "America",
        "ingredients": "Chickpeas\n\n400g / 14 oz can chickpeas, drained\n\n2 tbsp olive oil\n\nChickpeas spices\n\n1 tsp ground cumin\n\n1 1/2 tsp All Spice\n\n1 tsp ground cardamon\n\n1/4 tsp salt\n\nSalad\n\n2 cucumbers , diced\n\n2 tomatoes, diced\n\n1 red onion (small) , diced\n\n1/4 cup coriander leaves (cilantro), roughly chopped\n\n1/4 cup Italian parsley, roughly chopped\n\nDressing \n\n1 1/2 tbsp sherry or balsamic vinegar\n\nZest of half a lemon\n\n2 tbsp lemon juice\n\n1/4 cup extra virgin olive oil\n\n1 tsp caster sugar\n\n1 or 2 garlic clove, smashed\n\nSalt and pepper",
        "description": "Combine the Dressing ingredients in a jar and shake. Set aside for 20 minutes to allow the flavors to develop.\n\nPlace chickpeas in a large bowl. Scatter over Spices, toss to coat. The wetness of the chickpeas will make the spices stick.\n\nHeat 2 tbsp olive oil in a large pan over high heat and fry the chickpeas for a couple of minutes. Shake the pan so the chickpeas roll, or stir gently (so the spice coating doesn't come off). Transfer into bowl and cool slightly.\n\nCombine the Salad Ingredients in a bowl. Drizzle with a bit of Dressing and toss. Transfer to serving bowl.\n\nTop salad with chickpeas (warm or at room temperature). Drizzle with more Dressing. Toss very gently, if desired (don't toss too much or spices may shake off of the chickpeas). Serve immediately.\n\nGreat served with Greek yogurt and pita bread to stuff the salad into.",
        "imageName": "croutonsaladfull"
    },
    {
        "name": "Sauteed Shrimp",
        "category": "Main Course",
        "meat": "Shellfish",
        "cookTime": "5 minutes",
        "id": 1004,
        "isFeatured": false,
        "isFavorite": true,
        "country": "Italy",
        "ingredients": "Shrimp ingredients placeholder",
        "description": "Suscipit inceptos est felis purus aenean aliquet adipiscing diam venenatis, augue nibh duis neque aliquam tellus condimentum sagittis vivamus, cras ante etiam sit conubia elit tempus accumsan libero, mattis per erat habitasse cubilia ligula penatibus curae. Sagittis lorem augue arcu blandit libero molestie non ullamcorper, finibus imperdiet iaculis ad quam per luctus neque, ligula curae mauris parturient diam auctor eleifend laoreet ridiculus, hendrerit adipiscing sociosqu pretium nec velit aliquam. Inceptos egestas maecenas imperdiet eget id donec nisl curae congue, massa tortor vivamus ridiculus integer porta ultrices venenatis aliquet, curabitur et posuere blandit magnis dictum auctor lacinia, eleifend dolor in ornare vulputate ipsum morbi felis. Faucibus cursus malesuada orci ultrices diam nisl taciti torquent, tempor eros suspendisse euismod condimentum dis velit mi tristique, a quis etiam dignissim dictum porttitor lobortis ad fermentum, sapien consectetur dui dolor purus elit pharetra. Interdum mattis sapien ac orci vestibulum vulputate laoreet proin hac, maecenas mollis ridiculus morbi praesent cubilia vitae ligula vel, sem semper volutpat curae mauris justo nisl luctus, non eros primis ultrices nascetur erat varius integer.",
        "imageName": "buttershrimpfull"
    },
    {
        "name": "Oeufs Mimosa (Deviled Eggs)",
        "category": "Appetizer",
        "meat": "Vegetarian",
        "cookTime": "5 minutes",
        "id": 1005,
        "isFeatured": false,
        "isFavorite": false,
        "country": "Global",
        "ingredients": "12 Eggs\n\n1/2 cup Mayonnaise\n\n1/2 cup Fresh Parsley chopped fine\n\n1/2 cup of black pitted Mediterranean olives\n\n6 anchovies (optional)\n\nHerbed salt",
        "description": "Prep 6 cups of water to boil in a large pot.\n\nWhen the water reaches a rolling boil, drop in the eggs delicately.\n\nAfter 10 minutes, strain the water from the pan and run cold water over the eggs to cool them quickly.\n\nPeel them: it is easier to peel the eggs under running water.\n\nCut the hard boiled eggs in half lengthwise. Carefully remove the yolks with a spoon and divide the yolks into two batches in separate bowls.\n\nBatch 1: Mash the egg yolks, add some herbed salt, then add just enough mayonnaise to make a smooth spread  and fill the egg whites with this spread.\n\nBatch 2: Using a Rotary Cheese Grater or a grater with small holes, grate the yolks in a bowl.\n\nAdd parsley and sea salt to that batch and mix delicately with a fork.\n\nSprinkle the fluffy egg yolk generously over the filled eggs.\n\nDecorate with half pitted olive and half anchovy.",
        "imageName": "sunnyeggsfull"
    },
    {
        "name": "Apple Compote",
        "category": "Dessert",
        "meat": "Vegetarian",
        "cookTime": "1 hour",
        "id": 1006,
        "isFeatured": false,
        "isFavorite": false,
        "country": "France",
        "ingredients": "3 peeled apples\n\n1/4 cup brown sugar\n\n2 sticks of cinnamon\n\n1/2 cup of water\n\n1 sauce pot\n\n1 matching lid",
        "description": "Peel and cut the apples in quarters\n\nPlace the apples in a medium sized sauce pot with water and sprinkle with brown sugar. Place the cinnamon sticks in pot with apples\n\nAfter 10 minutes, lower the heat to a low heat or fire to simmer for an hour.\n\nWhen the apples are soft to the touch, they are ready. Take them off the heat and let them rest. Serve hot or cold.\n\nEnjoy!",
        "imageName": "applesaucefull"
    },
    {
        "name": "Caramel Flan",
        "category": "Dessert",
        "meat": "Vegetarian",
        "cookTime": "1 hour",
        "id": 1007,
        "isFeatured": true,
        "isFavorite": false,
        "country": "France",
        "ingredients": "When you find out\n\nLet me know\n\nAnd write it in here\n\nThanks",
        "description": "Make the caramel\n\nMaybe you should make the flan first.\n\nActually just test it out and I'll be here when you're done.\n\nEnjoy!",
        "imageName": "flanfull"
    },
    
]
